# baz_1 = {"Мигрень": {"Приступ": {"ТРИПТАНЫ": ["Суматриптан таб.50 мг,100мг ",
#                                               "Элетриптан Таб.40 мг ",
#                                               "Золмитриптан таб.2,5 мг",
#                                               "Наратриптан таб 2.5 мг"],
#                                  "Противорвотные": ["Метоклопрамид 10-20 мг внутрь",
#                                                     "Домперидон 20-30 мг внутрь"],
#                                  "НПВС": ["Ацетилсалициловая кислота 1000 внутрь",
#                                           "Ибупрофен 200 - 800 внутрь",
#                                           "Напроксен 500-1000 внутрь",
#                                           "Диклофенак 50-100 внутрь",
#                                           "Парацетамол 1000 внутрь"]}}}

